Project/Toir/src/Catalogs/Классы/Классы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Классы</name>
  <hierarchical>true</hierarchical>
  <hierarchyType>HierarchyOfItems</hierarchyType>
  <predefined>
    <items>
      <name>ВидыТехОпераций</name>
      <description>Виды тех.операции</description>
    </items>
    <items>
      <name>ВложенныеТехКарты</name>
      <description>Вложенные тех карты</description>
    </items>
    <items>
      <name>КлассыТехКарт</name>
      <description>Классы тех. карт</description>
    </items>
    <items>
      <name>СтрокиТехОпераций</name>
      <description>Строки тех.операций</description>
    </items>
    <items>
      <name>ТехнологическиеКарты</name>
      <description>Технологические карты</description>
    </items>
    <items>
      <name>ТипыТехКарт</name>
      <description>Типы тех. карт</description>
    </items>
    <items>
      <name>Оборудование</name>
      <description>Оборудование</description>
    </items>
  </predefined>
  <attributes>
    <name>НаименованиеПолное</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>255</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Статус</name>
    <type>
      <types>EnumRef.СтатусыОбъектовНСИ</types>
    </type>
  </attributes>
  <attributes>
    <name>ОтображатьВИерархииТО</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗначениеАтрибута</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>НоменклатураКласса</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ОбъектыНоменклатуры</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>КлассТабличнаяЧасть</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ШаблонКодаКласса</name>
    <type>
      <types>CatalogRef.ШаблоныЗаполнения</types>
    </type>
  </attributes>
  <attributes>
    <name>ФорматКодаКласса</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ШаблонНаименованияКласса</name>
    <type>
      <types>CatalogRef.ШаблоныЗаполнения</types>
    </type>
  </attributes>
  <attributes>
    <name>ШаблонКодаНоменклатуры</name>
    <type>
      <types>CatalogRef.ШаблоныЗаполнения</types>
    </type>
  </attributes>
  <attributes>
    <name>ФорматКодаНоменклатуры</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ШаблонНаименованияНоменклатуры</name>
    <type>
      <types>CatalogRef.ШаблоныЗаполнения</types>
    </type>
  </attributes>
  <attributes>
    <name>ШаблонКодаОбъекта</name>
    <type>
      <types>CatalogRef.ШаблоныЗаполнения</types>
    </type>
  </attributes>
  <attributes>
    <name>ФорматКодаОбъекта</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ШаблонНаименованияОбъекта</name>
    <type>
      <types>CatalogRef.ШаблоныЗаполнения</types>
    </type>
  </attributes>
  <attributes>
    <name>СчетчикКлассов</name>
    <type>
      <types>CatalogRef.Счетчики</types>
    </type>
  </attributes>
  <attributes>
    <name>СчетчикНоменклатуры</name>
    <type>
      <types>CatalogRef.Счетчики</types>
    </type>
  </attributes>
  <attributes>
    <name>СчетчикОбъектовНоменклатуры</name>
    <type>
      <types>CatalogRef.Счетчики</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерПоСчетчику</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>11</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ШагСчетчика</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>11</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПрисвоенНомерПоШаблону</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>РежимКонтроляДублейПоНаименованию</name>
    <type>
      <types>EnumRef.РежимыКонтроляДублей</types>
    </type>
  </attributes>
  <attributes>
    <name>КонтрольДублейВПределахКласса</name>
    <type>
      <types>CatalogRef.Классы</types>
    </type>
  </attributes>
</mdclass:Catalog>

Project/Toir/src/InformationRegisters/ЗначенияСчетчиков/ЗначенияСчетчиков.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ЗначенияСчетчиков</name>
  <resources>
    <name>НомерПоСчетчику</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>11</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>НомерРодителя</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>11</precision>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Объект</name>
    <type>
      <types>CatalogRef.ОбъектыНоменклатуры</types>
      <types>CatalogRef.Классы</types>
      <types>CatalogRef.НоменклатураКласса</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Счетчик</name>
    <type>
      <types>CatalogRef.Счетчики</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Project/Toir/src/Enums/СтатусыОбъектовНСИ/СтатусыОбъектовНСИ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>СтатусыОбъектовНСИ</name>
  <enumValues>
    <name>Черновик</name>
  </enumValues>
  <enumValues>
    <name>НаОбработке</name>
  </enumValues>
  <enumValues>
    <name>Активный</name>
  </enumValues>
  <enumValues>
    <name>НеАктивный</name>
  </enumValues>
  <enumValues>
    <name>Архив</name>
  </enumValues>
</mdclass:Enum>

Project/Toir/src/Catalogs/НоменклатураКласса/НоменклатураКласса.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>НоменклатураКласса</name>
  <hierarchical>true</hierarchical>
  <attributes>
    <name>Статус</name>
    <type>
      <types>EnumRef.СтатусыОбъектовНСИ</types>
    </type>
  </attributes>
  <attributes>
    <name>НаименованиеПолное</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>255</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Класс</name>
    <type>
      <types>CatalogRef.Классы</types>
    </type>
  </attributes>
  <attributes>
    <name>СодержитНоменклатуруКласса</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерПоСчетчику</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>11</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПрисвоенНомерПоШаблону</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ШагСчетчика</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>11</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОбъектТОиР</name>
    <type>
      <types>CatalogRef</types>
    </type>
  </attributes>
</mdclass:Catalog>

Project/Toir/src/Catalogs/ОбъектыНоменклатуры/ОбъектыНоменклатуры.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ОбъектыНоменклатуры</name>
  <attributes>
    <name>Статус</name>
    <type>
      <types>EnumRef.СтатусыОбъектовНСИ</types>
    </type>
  </attributes>
  <attributes>
    <name>НаименованиеПолное</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>255</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НоменклатураКласса</name>
    <type>
      <types>CatalogRef.НоменклатураКласса</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерПоСчетчику</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>11</precision>
      </numberQualifiers>
    </type>
  </attributes>
</mdclass:Catalog>

Project/Toir/src/Catalogs/Классы/ObjectModule.bsl
#Область ПрограммныйИнтерфейс

#КонецОбласти

#Область ОбработчикиСобытий

Процедура ПриУстановкеНовогоКода(СтандартнаяОбработка, Префикс)
	
	СтандартнаяОбработка = Ложь;
	
	Если ЗначениеЗаполнено(Ссылка) Тогда
		Запрос = Новый Запрос;
		Запрос.УстановитьПараметр("Счетчик", Справочники.Счетчики.СчетчикЧерновиков);
		Запрос.УстановитьПараметр("Объект", Ссылка);
		Запрос.Текст = 
			"ВЫБРАТЬ
			|	ЗначенияСчетчиков.НомерПоСчетчику
			|ИЗ
			|	РегистрСведений.ЗначенияСчетчиков КАК ЗначенияСчетчиков
			|ГДЕ
			|	ЗначенияСчетчиков.Счетчик = &Счетчик
			|	И ЗначенияСчетчиков.Объект = &Объект";
		Результат = Запрос.Выполнить().Выбрать();
		Если Результат.Следующий() Тогда
			НомерПоСчетчику = Результат.НомерПоСчетчику;
		Иначе
			НомерПоСчетчику = ШаблоныСтрокСервер.ПолучитьНовоеЗначениеСчетчика(Справочники.Счетчики.СчетчикЧерновиков, 1);
		КонецЕсли;
	Иначе
		НомерПоСчетчику = ШаблоныСтрокСервер.ПолучитьНовоеЗначениеСчетчика(Справочники.Счетчики.СчетчикЧерновиков, 1);
	КонецЕсли;
	Код = ШаблоныСтрокКлиентСервер.ФорматироватьСтроку(Формат(НомерПоСчетчику, "ЧГ=0"), """Ч""!0000000000000000000");
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ)
	
	
	
КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	
	ТаблицаРодителей = Справочники.Классы.ПолучитьТаблицуРодителей(Ссылка);
	МассивРодителей = ТаблицаРодителей.ВыгрузитьКолонку("Класс");
	
	// Настраиваем иерархию номенклатуры по иерархии классов.
	ЗаписатьИерархиюНоменклатурыКлассов(ТаблицаРодителей);
	
	ЗаписатьЗначенияСчетчиков();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ЗаписатьИерархиюНоменклатурыКлассов(ТаблицаРодителей)
	
	// Выбираем группу номенклатуры, которая соответствует текущему классу.
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	НоменклатураКласса.Ссылка,
		|	НоменклатураКласса.Код,
		|	НоменклатураКласса.Наименование,
		|	НоменклатураКласса.Родитель,
		|	НоменклатураКласса.ПометкаУдаления КАК ПометкаУдаления,
		|	НоменклатураКласса.СодержитНоменклатуруКласса
		|ИЗ
		|	Справочник.НоменклатураКласса КАК НоменклатураКласса
		|ГДЕ
		|	НоменклатураКласса.Класс = &Ссылка
		|	И НоменклатураКласса.ЭтоГруппа
		|
		|УПОРЯДОЧИТЬ ПО
		|	ПометкаУдаления УБЫВ";
	Результат = Запрос.Выполнить().Выбрать();
	Если Результат.Следующий() Тогда
		ГруппаНоменклатурыКлассов            = Результат.Ссылка;
		ГруппаНоменклатурыПомеченаНаУдаление = Результат.ПометкаУдаления;
		ГруппаСодержитНоменклатуруКласса     = Результат.СодержитНоменклатуруКласса;
		ГруппаКодКласса                      = Результат.Код;
		ГруппаНаименованиеКласса             = Результат.Наименование;
		ГруппаНоменклатурыРодительЗаписан    = Результат.Родитель;
	КонецЕсли;
	
	// Записываем таблицу родителей в менеджер ВТ.
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	Запрос.УстановитьПараметр("ТаблицаРодителей", ТаблицаРодителей);
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ТаблицаРодителей.Класс,
		|	ТаблицаРодителей.Уровень
		|ПОМЕСТИТЬ ВТ_ТаблицаРодителей
		|ИЗ
		|	&ТаблицаРодителей КАК ТаблицаРодителей";
	Запрос.Выполнить();
	
	// Выбираем первого родителя, который отображается в иерархии номенклатуры классов.
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	МАКСИМУМ(ВТ_ТаблицаРодителей.Уровень) КАК Уровень
		|ПОМЕСТИТЬ ВТ_МаксУровень
		|ИЗ
		|	Справочник.Классы КАК Классы
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_ТаблицаРодителей КАК ВТ_ТаблицаРодителей
		|		ПО Классы.Ссылка = ВТ_ТаблицаРодителей.Класс
		|ГДЕ
		|	Классы.ОтображатьВИерархииТО
		|	И НЕ Классы.Ссылка = &Ссылка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ ПЕРВЫЕ 1
		|	НоменклатураКласса.Ссылка,
		|	НоменклатураКласса.ПометкаУдаления КАК ПометкаУдаления,
		|	НоменклатураКласса.Класс.ПометкаУдаления КАК ПометкаУдаленияВладельца
		|ИЗ
		|	Справочник.НоменклатураКласса КАК НоменклатураКласса
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_ТаблицаРодителей КАК ВТ_ТаблицаРодителей
		|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_МаксУровень КАК ВТ_МаксУровень
		|			ПО ВТ_ТаблицаРодителей.Уровень = ВТ_МаксУровень.Уровень
		|		ПО НоменклатураКласса.Класс = ВТ_ТаблицаРодителей.Класс
		|ГДЕ
		|	НоменклатураКласса.ЭтоГруппа
		|
		|УПОРЯДОЧИТЬ ПО
		|	ПометкаУдаления УБЫВ";
	Результат = Запрос.Выполнить().Выбрать();
	Если Результат.Следующий() Тогда
		ГруппаНоменклатурыРодитель = Результат.Ссылка;
		Если НЕ Результат.ПометкаУдаления = Результат.ПометкаУдаленияВладельца Тогда
			ГруппаОбъект = ГруппаНоменклатурыРодитель.ПолучитьОбъект();
			ГруппаОбъект.УстановитьПометкуУдаления(Результат.ПометкаУдаленияВладельца, Ложь);
		КонецЕсли;
	Иначе
		ГруппаНоменклатурыРодитель = Справочники.НоменклатураКласса.ПустаяСсылка();
	КонецЕсли;
	
	Если НЕ ОтображатьВИерархииТО Тогда
		
		Если ЗначениеЗаполнено(ГруппаНоменклатурыКлассов) И НЕ ГруппаНоменклатурыПомеченаНаУдаление Тогда
			ГруппаОбъект = ГруппаНоменклатурыКлассов.ПолучитьОбъект();
			ГруппаОбъект.УстановитьПометкуУдаления(Истина, Ложь);
		КонецЕсли;
		
		ГруппаНоменклатурыКлассов = ГруппаНоменклатурыРодитель;
		
	Иначе
		// Если в справочнике номенклатуры не создана группа, создаем ее.
		Если НЕ ЗначениеЗаполнено(ГруппаНоменклатурыКлассов) Тогда
			ГруппаОбъект = Справочники.НоменклатураКласса.СоздатьГруппу();
			ГруппаОбъект.Наименование       = Наименование;
			ГруппаОбъект.НаименованиеПолное = НаименованиеПолное;
			ГруппаОбъект.Класс              = Ссылка;
			ГруппаОбъект.СодержитНоменклатуруКласса = НоменклатураКласса;
			ГруппаОбъект.Родитель           = ГруппаНоменклатурыРодитель;
			ГруппаОбъект.ПометкаУдаления    = ПометкаУдаления;
			ГруппаОбъект.Код                = Код;
			ГруппаОбъект.Записать();
			
			ГруппаНоменклатурыКлассов = ГруппаОбъект.Ссылка;
			
		ИначеЕсли НЕ ГруппаНоменклатурыПомеченаНаУдаление = ПометкаУдаления Тогда
			ГруппаОбъект = ГруппаНоменклатурыКлассов.ПолучитьОбъект();
			Если НЕ ГруппаОбъект.СодержитНоменклатуруКласса = НоменклатураКласса 
					ИЛИ НЕ ГруппаКодКласса = Код 
					ИЛИ НЕ ГруппаНаименованиеКласса = Наименование
					ИЛИ НЕ ГруппаНоменклатурыРодительЗаписан = ГруппаНоменклатурыРодитель Тогда
				ГруппаОбъект.СодержитНоменклатуруКласса = НоменклатураКласса;
				ГруппаОбъект.Код                        = Код;
				ГруппаОбъект.Наименование               = Наименование;
				ГруппаОбъект.Родитель                   = ГруппаНоменклатурыРодитель;
				ГруппаОбъект.Записать();
				
			КонецЕсли;
			
			ГруппаОбъект.УстановитьПометкуУдаления(ПометкаУдаления, Ложь);
			
		ИначеЕсли НЕ ГруппаСодержитНоменклатуруКласса = НоменклатураКласса 
				ИЛИ НЕ ГруппаКодКласса = Код 
				ИЛИ НЕ ГруппаНаименованиеКласса = Наименование
				ИЛИ НЕ ГруппаНоменклатурыРодительЗаписан = ГруппаНоменклатурыРодитель Тогда
			ГруппаОбъект = ГруппаНоменклатурыКлассов.ПолучитьОбъект();
			ГруппаОбъект.СодержитНоменклатуруКласса = НоменклатураКласса;
			ГруппаОбъект.Код                        = Код;
			ГруппаОбъект.Наименование               = Наименование;
			ГруппаОбъект.Родитель                   = ГруппаНоменклатурыРодитель;
			ГруппаОбъект.Записать();
			
		КонецЕсли;
		
	КонецЕсли;
	
	// Переподчиним номенклатуру всех подчиненных классов выбранной группе, 
	// за исключением тех дочерних классов, которые тоже включены в иерархию номенклатуры.
	Запрос.УстановитьПараметр("ГруппаНоменклатурыКлассов", ГруппаНоменклатурыКлассов);
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Классы.Ссылка
		|ПОМЕСТИТЬ ВТ_КлассыИсключений
		|ИЗ
		|	Справочник.Классы КАК Классы
		|ГДЕ
		|	Классы.Ссылка В ИЕРАРХИИ(&Ссылка)
		|	И Классы.ОтображатьВИерархииТО
		|	И НЕ Классы.Ссылка = &Ссылка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	НоменклатураКласса.Ссылка
		|ИЗ
		|	Справочник.НоменклатураКласса КАК НоменклатураКласса
		|ГДЕ
		|	НоменклатураКласса.Класс В ИЕРАРХИИ(&Ссылка)
		|	И НЕ НоменклатураКласса.Класс В ИЕРАРХИИ
		|				(ВЫБРАТЬ
		|					ВТ_КлассыИсключений.Ссылка
		|				ИЗ
		|					ВТ_КлассыИсключений КАК ВТ_КлассыИсключений)
		|	И НЕ НоменклатураКласса.Родитель = &ГруппаНоменклатурыКлассов
		|	И НЕ НоменклатураКласса.Ссылка = &ГруппаНоменклатурыКлассов";
	Результат = Запрос.Выполнить().Выбрать();
	Пока Результат.Следующий() Цикл
		НоменклатураОбъект = Результат.Ссылка.ПолучитьОбъект();
		НоменклатураОбъект.Родитель = ГруппаНоменклатурыКлассов;
		НоменклатураОбъект.Записать();
	КонецЦикла;
	
КонецПроцедуры

Процедура ЗаписатьЗначенияСчетчиков()
	
	ЗаписатьНомерПоСчетчику = (НомерПоСчетчику > 0);
	ПодчиненРодителю = Ложь;
	НомерРодителя = 0;
	СчетчикДляЗаписи = ?(ПрисвоенНомерПоШаблону, СчетчикКлассов, Справочники.Счетчики.СчетчикЧерновиков);
	Если ПрисвоенНомерПоШаблону И ЗаписатьНомерПоСчетчику Тогда
		СписокРодителей = Справочники.Классы.ПолучитьТаблицуРодителей(Ссылка, 
			"ШаблонКодаКласса, СчетчикКлассов, ПрисвоенНомерПоШаблону, НомерПоСчетчику, ШагСчетчика");
		УровеньОбъекта  = СписокРодителей.Количество();
		ШаблонРодителя = Справочники.Классы.ПолучитьЗначениеРодителя(СписокРодителей, УровеньОбъекта - 1, "ШаблонКодаКласса");
		СчетчикРодителя = ШаблоныСтрокСервер.ПолучитьСчетчикДляУровня(
			ШаблонРодителя, УровеньОбъекта, СписокРодителей, "СчетчикКлассов");
		
		РеквизитыРодителя = СписокРодителей[УровеньОбъекта - 2];
		ПодчиненРодителю = (НЕ СчетчикРодителя = Неопределено
			И СчетчикРодителя.ИспользованиеСУровня < УровеньОбъекта
			И РеквизитыРодителя.ШагСчетчика > ШагСчетчика);
		НомерРодителя = ?(ПодчиненРодителю И РеквизитыРодителя.ПрисвоенНомерПоШаблону, РеквизитыРодителя.НомерПоСчетчику, 0);
		СчетчикДляЗаписи = СчетчикРодителя.Счетчик;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Объект", Ссылка);
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЗначенияСчетчиков.Счетчик,
		|	ЗначенияСчетчиков.НомерПоСчетчику,
		|	ЗначенияСчетчиков.НомерРодителя
		|ИЗ
		|	РегистрСведений.ЗначенияСчетчиков КАК ЗначенияСчетчиков
		|ГДЕ
		|	ЗначенияСчетчиков.Объект = &Объект";
	ЗаписанныеЗначения = Запрос.Выполнить().Выгрузить();
	// Удаляем лишние записи регистра "ЗначенияСчетчиков".
	Если ЗаписанныеЗначения.Количество() > 0 Тогда
		// Из списка удаляемых исключаем правильную запись.
		Если ЗаписатьНомерПоСчетчику Тогда
			Найдено = ЗаписанныеЗначения.НайтиСтроки(Новый Структура("Счетчик", СчетчикДляЗаписи));
			Если Найдено.Количество() > 0 Тогда
				ЗаписатьНомерПоСчетчику = 
					(НЕ Найдено[0].НомерПоСчетчику = НомерПоСчетчику ИЛИ НЕ Найдено[0].НомерРодителя = НомерРодителя);
				ЗаписанныеЗначения.Удалить(Найдено[0]);
			КонецЕсли;
		КонецЕсли;
			
		Для Каждого ЗаписьКУдалению ИЗ ЗаписанныеЗначения Цикл
			Запись = РегистрыСведений.ЗначенияСчетчиков.СоздатьМенеджерЗаписи();
			Запись.Счетчик = ЗаписьКУдалению.Счетчик;
			Запись.Объект  = Ссылка;
			Запись.Удалить();
		КонецЦикла;
	КонецЕсли;
	
	Если ЗаписатьНомерПоСчетчику Тогда
		
		Запись = РегистрыСведений.ЗначенияСчетчиков.СоздатьМенеджерЗаписи();
		
		Запись.Объект          = Ссылка;
		Запись.Счетчик = СчетчикДляЗаписи;
		Запись.НомерПоСчетчику = НомерПоСчетчику;
		Запись.НомерРодителя   = НомерРодителя;
		
		Запись.Записать();
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область НеИспользуемыеПроцедурыИФункции

Процедура СброситьФлагиНоменклатураОбъектНоменклатурыУРодителей(ТаблицаРодителей)
	
	Для Каждого СтрокаРодитель ИЗ ТаблицаРодителей Цикл
		Если НЕ ЗначениеЗаполнено(СтрокаРодитель.Класс) 
				ИЛИ НЕ СтрокаРодитель.НоменклатураКласса И НЕ СтрокаРодитель.ОбъектыНоменклатуры
				ИЛИ СтрокаРодитель.КлассТабличнаяЧасть
				ИЛИ СтрокаРодитель.Класс = Ссылка Тогда
			Продолжить;
		КонецЕсли;
		СпрОбъект = СтрокаРодитель.Класс.ПолучитьОбъект();
		СпрОбъект.НоменклатураКласса = Ложь;
		СпрОбъект.ОбъектыНоменклатуры = Ложь;
		СпрОбъект.Записать();
	КонецЦикла;
	
КонецПроцедуры

Процедура СброситьАктивностьУНоменклатурыРодителей(МассивРодителей)
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("МассивРодителей", МассивРодителей);
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	НоменклатураКласса.Ссылка
		|ИЗ
		|	Справочник.НоменклатураКласса КАК НоменклатураКласса
		|ГДЕ
		|	НоменклатураКласса.Класс В(&МассивРодителей)
		|	И НЕ НоменклатураКласса.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыОбъектовНСИ.НеАктивный)
		|	И НЕ НоменклатураКласса.Класс.НоменклатураКласса
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ОбъектыНоменклатуры.Ссылка
		|ИЗ
		|	Справочник.ОбъектыНоменклатуры КАК ОбъектыНоменклатуры
		|ГДЕ
		|	ОбъектыНоменклатуры.НоменклатураКласса.Класс В(&МассивРодителей)
		|	И НЕ ОбъектыНоменклатуры.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыОбъектовНСИ.НеАктивный)
		|	И НЕ ОбъектыНоменклатуры.НоменклатураКласса.Класс.ОбъектыНоменклатуры";
	Результат = Запрос.Выполнить().Выбрать();
	Пока Результат.Следующий() Цикл
		СпрОбъект = Результат.Ссылка.ПолучитьОбъект();
		СпрОбъект.Статус = Перечисления.СтатусыОбъектовНСИ.НеАктивный;
		СпрОбъект.Записать();
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти
